{"data":{"markdownRemark":{"html":"<p>I love Mekentosj’s <a href=\"http://www.papersapp.com/\">Papers</a>, and <a href=\"/2013/05/05/citation-management-papers/\">encourage you to check it out if you are on a mac and keep digital literature.</a></p>\n<p>One of the things that drove me nuts using my advisor’s Endnote library was that I couldn’t change it.  Each publication, each grant, it would be my task to go through and manually “spruce up” the references.  Each time I would plea to change the actual source library, and each time I’d be told we had no time as it was the 11th hour.  Everything was inevitably inconsistent.  Author names, journal abbreviations, italicizing species name.  What a mess.</p>\n<p>Now that I am in charge and doing my own references, I can keep a clean house.  This means fixing references the “right” way, in Papers.</p>\n<p>A good way to fix up a lot of metadata easily is to manage your periodical collection. To do this, click on your periodicals tab under sources, and sort them by name.  Merge journals that should be the same- Set a standardized way of abbreviating (I do without periods), stick with it.  A thorough periodicals cleaning will make formatting your final bibliography much easier.</p>\n<p><img src=\"/wp-content/uploads/2013/07/screen-shot-2013-07-07-at-1-24-37-pm.png\" alt=\"image\"></p>\n<p>Are there repeats?  Merge them!  Is the abbreviated title appearing in the full title field?  Fix it!  Do it here, and you are fixing each and every affiliated journal!  Format BMC Microbiology right here, and every time an article from BMC Micro comes in, it’ll be properly formatted (provided it’s correctly linked to this journal entry!)</p>\n<p><img src=\"/wp-content/uploads/2013/07/screen-shot-2013-07-07-at-1-37-21-pm.png\" alt=\"BMC\"></p>\n<blockquote>\n<p>BMC Biotechnology has the abbreviation in both the full and abbreviated field. An easy fix!</p>\n</blockquote>\n<p>Sometimes you’ll see weird journal titles.  Are they really journals, or is it a book or chapter set to the wrong source type?  Make sure each article is set to the correct type.  A PhD chapter that thinks it is a journal article is going to be formatted incorrectly.</p>\n<p><img src=\"/wp-content/uploads/2013/07/screen-shot-2013-07-07-at-1-28-50-pm.png\" alt=\"editing\"></p>\n<blockquote>\n<p>Enable editing to change the source type for an article.</p>\n</blockquote>\n<p>As I continue battling my own citations, I’ll post again with more tips for tidying up your references.</p>","frontmatter":{"title":"Papers as a reference manager"}}},"pageContext":{"slug":"/2013-07-07-papers-as-a-reference-manager/"}}