{"data":{"markdownRemark":{"html":"<p><img src=\"/img/d3/d3_logo.png\" alt=\"D3 logo\"></p>\n<p><a href=\"https://d3js.org/\">D3js (Data-Driven Documents)</a> is a Javascript library that manipulates the DOM and is often used to build SVG plots.  I recently created an interactive plot for differential expression data as part of the <a href=\"https://github.com/tripal/tripal_analysis_expression/\">Tripal Analysis Expression module</a>. Because other Tripal modules use D3 v3.x, I was required to do the same (as opposed to v4, the latest version).  While the <a href=\"https://github.com/d3/d3-3.x-api-reference/blob/master/API-Reference.md\">API is available</a>, I'm the sort of person who learns best from tutorials and examples, and I struggled to find enough v3 examples.</p>\n<!--more-->\n<blockquote>\n<p><img src=\"/img/d3/taexp_plot.png\" alt=\"Tripal Analysis Expression plot\"></p>\n<p>The Tripal Analysis Expression module groups and colors data based on user selection. Each group can be dragged and rearranged.  By the end of this series, you'll be able to create higher order plots like this in D3.</p>\n</blockquote>\n<p>With that in mind, I am writing this basic D3js v3 tutorial. This is installment one, where we create a very basic and unimpressive plot using just <code>data()</code> and <code>enter()</code>.  I recommend some starting resources below, but this tutorial is aimed at beginners.</p>\n<p>The code for this lesson is available as a <a href=\"https://gist.github.com/bradfordcondon/317fe6b4edd66ba3904ed2248f8b6134\">GitHub gist</a>, or visualized with <a href=\"https://bl.ocks.org/bradfordcondon/317fe6b4edd66ba3904ed2248f8b6134\">Bl.ocks</a>.</p>\n<h3>Background reading</h3>\n<p>Before we get started, you should understand the basics of </p>\n<ul>\n<li><a href=\"https://www.javascript.com/\">Javascript</a></li>\n<li><a href=\"https://jquery.com/\">jQuery</a></li>\n<li>The <a href=\"https://www.w3schools.com/js/js_htmldom.asp\">DOM model</a></li>\n<li><a href=\"https://www.w3schools.com/graphics/svg_intro.asp\">SVG</a></li>\n<li>A browser developer console such as <a href=\"https://developer.chrome.com/devtools\">Google Chrome</a></li>\n</ul>\n<p>I'd also recommend looking over the <a href=\"https://d3js.org/\">D3 website</a> and reading the introduction/gaining inspiration from the plots.</p>\n<h3>Why D3?</h3>\n<p>There are other plotting solutions for javascript.  I like D3 because it strikes a nice balance between ease of use and flexibility.  It might be easier to get results plotting something with, for example, <a href=\"https://plot.ly/javascript/\">plot.ly</a> (which is built on top of D3), but the higher layer of abstraction leaves you with fewer options.</p>\n<h2>D3: the basics</h2>\n<p>I recommended reading about jQuery in the introduction because they share the same fundamental goal: select objects in the DOM and manipulate them.  jQuery is much broader in scope: it's a general purpose javascript library.  D3's twist is revealed in it's name: Data-Driven Documents.  The assumption is that you've got data (represented in an array) and you want to <em>apply</em> that data to the DOM.  Typically, that means visualize it in some way!     </p>\n<h3>Show me the data</h3>\n<p>How does D3 communicate your data to the DOM?  Using the <code>data()</code>, <code>enter()</code> methods!</p>\n<p>Let's make a simple example.  You can follow along by pasting the code into text editor and opening the file in a web browser.</p>\n<pre><code class=\"language-javascript\">&#x3C;!DOCTYPE html>\n&#x3C;style>\n.axis .domain {\n  display: none;\n}\n&#x3C;/style>\n&#x3C;svg width=\"960\" height=\"500\">&#x3C;/svg> \n&#x3C;script src=\"https://d3js.org/d3.v3.min.js\">&#x3C;/script>\n&#x3C;script>\n  \nvar data = [{name: \"one\", property: \"a\", value: 100},\n             {name: \"two\", property: \"a\", value: 50},\n              {name: \"two\", property: \"b\", value: 20},\n             {name: \"four\", property: \"b\", value: 57}, ];\n  \n  var svg = d3.select(\"svg\") \n    \n var bars=  svg.selectAll('.bar')\n    .data(data)\n    .enter()\n    .append('g')\n   .attr('transform', function (d, i) {\n  return 'translate(' + i* 20 + ',0)'; \n  }).append('rect')\n .style('fill', \"red\")\n .style(\"height\", function (d, i) {\n return d.value})\n .attr('width', 10)\n  \n  &#x3C;/script>\n  \n</code></pre>\n<p>Below is the resulting plot.</p>\n<div id=\"output_plot\"></div>\n<p>There's a couple of problems here, but let's see what we are trying to do.</p>\n<ul>\n<li>We define a data array consisting of objects with some simple key => value pairs.  For now we just use the <code>name</code> and <code>value</code> property.</li>\n<li>We define and select the <code>svg</code> element which holds our graphics.</li>\n<li>We enter our data into the <code>svg</code> using the <code>data()</code> and <code>enter()</code> calls.</li>\n<li>We append <code>g</code> elements to each <code>.bar</code> object. </li>\n<li>We transform each <code>g</code> object by translating it, shifting it along the x-axis.</li>\n<li>We append a <code>rect</code> element.</li>\n<li>We transform the  <code>rect</code> element based on the data.</li>\n</ul>\n<p>Pay special attention to <code>function (d, i) {//code}</code>.  Because we've entered our data, we can define a function that takes the <em><code>i</code>th</em> element of the <code>data</code> array as <code>d</code> as an input, and outputs what we want. </p>\n<h3>Chaining</h3>\n<p>D3 allows for <em>chaining</em> method calls together, much like jQuery.  In the above example, we took advantage of chaining several times.  For example...</p>\n<pre><code class=\"language-js\"> var bars=  svg.selectAll('.bar')\n    .data(data)\n    .enter()\n    .append('g')\n</code></pre>\n<p>What's important to understand is that the chain is executed in order, and each link in the chain passes down its selection to the next member.  This means that subsequent calls after <code>.append('g')</code> will <em>affect that g element</em>.  On the other hand, setting the <code>style</code> or <code>attr</code> of an element will pass on the reference element, meaning you can execute several <code>style</code> calls in a row on the same element (as we do above)</p>\n<p>If chaining confuses you, the above code could be written without chaining, as </p>\n<pre><code class=\"language-js\"> var bars=  svg.selectAll('.bar')\n bars.data(data)\n bars.enter()\n bars.append('g')\n</code></pre>\n<h3>Entering data with  <code>.selectAll().data().enter().append()</code></h3>\n<p>This chain will look very familiar to you the more you use D3.  The <code>data</code> method requires a selection to bind data to.  It might be confusing that we select all <code>.bar</code> elements in the above example: what <code>.bar</code>?  They <strong>dont exist yet!</strong></p>\n<p>That's where <code>.enter()</code> comes in.  It compares the data in <code>data()</code> and the selection, and creates new placeholder elements for the entered data.</p>\n<h3>Looping through data</h3>\n<p>You may be confused how each element gets \"told\" what its height and x-position should be.  The answer lies in how D3 has created an element for each element in our data array.</p>\n<p>Consider how we style the height in the above code:</p>\n<pre><code class=\"language-js\">.style(\"height\", function (d, i) {\n return d.value})\n</code></pre>\n<p>Rather than returning a fixed height, we use a <strong>function</strong> to dynamically return the height based on <code>d</code> and <code>i</code>.  <code>d</code> is the individual data entry, and <code>i</code> is its key.  In our example code, when <code>i = 2</code>, <code>d = {name: \"two\", property: \"a\", value: 50}</code>.</p>\n<p>Because our data structure has a <code>value</code> key, simply returning <code>d.value</code> will set the height of the bar based on the value of that element!  If you are getting confused, I recommend including a <code>console.log(d)</code> in your function.  You'll see in your console that each data object in the array is returned one by one.</p>\n<h2>Building a better plot</h2>\n<p>This is clearly not an award winning plot.  We have no axes, scaling, grouping, labels, legends, or titles.  The colors are uniform.  Oh, and it's upside down (a surprisingly persistent problem with D3!)</p>\n<p>We'll cover the rest in later lessons.  But for now, try to define your own dataset and bind it to the DOM using <code>data()</code> and <code>enter()</code>.</p>\n<p>Continue reading with <a href=\"/2017/12/31/d3_part2_flipping/\">part two: implementing scales</a>.</p>\n<p>Did you enjoy this article?  Looking for more information?  Please feel free to contact me on twitter @bradfordcondon</p>","frontmatter":{"title":"Plotting with D3 part 1"}}},"pageContext":{"slug":"/2017-12-22-plotting_with_d3/"}}