{"data":{"markdownRemark":{"html":"<p style=\"text-align: center;\">\n  Bradford Condon, PhD\n</p>\n<h2>Education</h2>\n<p>August 2013, PhD in Plant Pathology &#x26; Plant-Microbe Interactions, Cornell University, Ithaca, NY</p>\n<p>May 2007, BA in Biology and Religion, Oberlin College, Oberlin, OH</p>\n<h2>Employment</h2>\n<p>September 2018 to present: IT Specialist III, University of Tennessee</p>\n<p>February 2017 to September 2018: Postdoctoral associate, Department of Entomology and Plant Pathology, University of Tennessee, Knoxville.</p>\n<blockquote>\n<p>I develop the Hardwood Genomics Web (HWG), a web site that houses genetic and genomic data from a variety of hardwood tree species.  I contribute to Tripal, an open source genomic database and website framework. I also authored the mobile app TreeSnap, which allows citizens to partner with scientists to track and study trees.  I serve as the biological point person for undergraduate and graduate lab programmers to help them understand the underlying database model.</p>\n</blockquote>\n<p>January 2016 to January 2017: Postdoctoral associate, Department of Plant Pathology, University of Kentucky.</p>\n<blockquote>\n<p>Performed bioinformatic analyses for whole-genome alignment and phylogenetics of the rice blast pathogen <em>magnaporthe oryzae</em>.  Developed and implemented a mentoring program in bioinformatics for undergraduate biologists, UK-BLAST.</p>\n</blockquote>\n<p>June 2014 to December 2015: Postdoctoral associate, Department of Ecology, Evolution, and Behavior, University of Minnesota.</p>\n<blockquote>\n<p>Planned and implemented a large-scale metagenomic study of bacterial and fungal endophytes for over 1,000 native prairie grass leaves.  Designed a metagenomic sequencing and analysis pipeline.</p>\n</blockquote>\n<p>August 2007 to June 2014: Graduate Student and Post-Doctoral fellow, Department of Plant Pathology &#x26; Plant-Microbe Interactions, Cornell University, advised by Dr. <a href=\"http://www.plantpath.cornell.edu/labs/turgeon/index.html\">B Gillian Turgeon</a></p>\n<blockquote>\n<p>Performed genetic and genomic studies using the model fungal phytopathogen Cochliobolus heterostrophus.  Acted as lab co-manager in charge of ordering and hiring/training/managing undergraduate students.</p>\n</blockquote>\n<h2>Accomplishments</h2>\n<ul>\n<li>\n<p><a href=\"tripal.info\">Tripal</a> project manager.</p>\n<ul>\n<li>Established testing protocols and continuous integration testing.</li>\n<li>Formed a governance structure with contribution guidelines and requirements.</li>\n</ul>\n</li>\n<li>Upgraded <a href=\"https://hardwoodgenomics.org/\">HardwoodGenomics</a> to Tripal 3, performed bioinformatic analyses and uploaded new data to site.</li>\n<li>Co-developer of <a href=\"https://treesnap.org/\">TreeSnap</a>, mobile citizen science app.</li>\n</ul>\n<h2>Software</h2>\n<h4>Tripal</h4>\n<ul>\n<li>\n<p><a href=\"https://github.com/tripal/tripal_analysis_expression\">Tripal Analysis Expression Module</a> </p>\n<ul>\n<li>For loading and display of RNASeq data, from biological source material to gene expression data  </li>\n<li>DOI: 10.5281/zenodo.1115662</li>\n</ul>\n</li>\n<li>\n<p><a href=\"https://github.com/tripal/tripal_elasticsearch\">Tripal ElasticSearch Module</a></p>\n<ul>\n<li>For installing and managing sitewide search, customized search forms, and cross-Tripal-site queries via ElasticSearch</li>\n<li>DOI: 10.5281/zenodo.1193925</li>\n</ul>\n</li>\n<li>\n<p><a href=\"https://github.com/statonlab/fields_generator\">Tripal Fields Generator</a></p>\n<ul>\n<li>Developer CLI tool to automate Tripal field creation for Tripal v3 development </li>\n<li>DOI: 10.5281/zenodo.1200662</li>\n</ul>\n</li>\n<li>\n<p><a href=\"https://github.com/statonlab/TripalTestSuite\">Tripal TestSuite</a></p>\n<ul>\n<li>A composer package that handles common test practices such as bootstrapping Drupal before running the tests, creating test file, and creating and managing database seeders.</li>\n<li>DOI: 10.5281/zenodo.1209904</li>\n</ul>\n</li>\n<li>\n<p><a href=\"https://github.com/statonlab/tripal_alchemist\">Tripal Alchemist</a></p>\n<ul>\n<li>Enables bulk transformation of Tripal entities from one type to another</li>\n<li>DOI: 10.5281/zenodo.1187120</li>\n</ul>\n</li>\n</ul>\n<h4>TreeSnap</h4>\n<ul>\n<li><a href=\"https://github.com/statonlab/Treesnap-mobile\">Mobile</a></li>\n<li><a href=\"https://github.com/statonlab/Treesnap-website\">Web</a></li>\n</ul>\n<h2>Skills</h2>\n<h4>Bioinformatics and programming</h4>\n<ul>\n<li>\n<p>Proficient with UNIX/LINUX systems, command-line programming, querying and managing big data/databases</p>\n</li>\n<li>\n<p>Developer for cross-platform (iOS and Android) apps in React-Native, and genomics websites using Tripal and Drupal.</p>\n</li>\n<li>\n<p>Experience designing experiments and analyzing data for a wide variety of bioinformatic projects, including </p>\n<ul>\n<li>Metagenomics</li>\n<li>RNA-seq and transcriptomics</li>\n<li>Genome assembly and annotation</li>\n<li>Phylogenetics</li>\n</ul>\n</li>\n<li>\n<p>Programming languages: <strong>R, Perl, javascript, PHP, CSS, Ruby, SQL</strong></p>\n</li>\n<li>\n<p>Frameworks: <strong>Laravel, Drupal, Wordpress, React, React Native</strong></p>\n</li>\n</ul>\n<h4>Molecular biology</h4>\n<ul>\n<li>Fungal and bacterial culture, transformation, and phenotyping</li>\n<li>Molecular bio bench skills include DNA extraction, PCR, southern/northern blotting, light and confocal microscopy</li>\n<li>Next-gen (illumina) library preparation</li>\n<li>Greenhouse management</li>\n</ul>\n<h4>Communication and mentorship</h4>\n<ul>\n<li>\n<p>Formed UK-BLAST, the undergraduate bioinformatics mentorship group at the University of Kentucky </p>\n<ul>\n<li>Leading and designing workshops in bioinformatics</li>\n<li>Co-mentoring and advising students on their bioinformatics projects</li>\n</ul>\n</li>\n<li>Strong track record of supervising undergraduates in the laboratory and integrating their work into complex workflows</li>\n<li>Co-PI awardee for bringing <a href=\"http://www.eyhn.org/\">Expanding Your Horizons</a>, a STEM conference for young girls, to the University of Kentucky</li>\n<li>Community outreach and education on fungi includes presentations at Floracliff Nature Sanctuary and the Kentucky Food Retail Safety conference</li>\n</ul>\n<h4>Awards and honors</h4>\n<ul>\n<li>2006 Oberlin College Norman H Wright Prize for undergraduate research</li>\n<li>2007-2008 Presidential Life Science Fellow</li>\n<li>2009 NSF graduate research fellowship honorable mention</li>\n<li>2010 NSF EAPSI fellow (New Zealand)</li>\n<li>2011 Plant Sciences outstanding TA award</li>\n<li>2012 McClintock Outstanding Plant Sciences Graduate Student Award</li>\n<li>2011-2012 Center For Teaching Excellence Graduate Teaching Associate Fellow</li>\n<li>2012-2013 Center For Teaching Excellence Graduate Teaching Associate Fellow</li>\n<li>2017 NSF EPSCoR grant, <a href=\"http://www.eyhn.org/\">Expanding Your Horizons</a></li>\n<li>2017 <a href=\"http://sops.as.uky.edu/?q=content/symposia\">UKY SOPS</a> research symposium postdoc poster award (second place)</li>\n</ul>\n<h4>Teaching and leadership</h4>\n<h5>Data and Software Carpentry Certified Instructor 2017</h5>\n<p>Trained and certified as a <a href=\"http://www.datacarpentry.org/\">Data Carpentry</a> and <a href=\"https://software-carpentry.org/\">Software Carpentry</a> Instructor. </p>\n<p><a href=\"/gatsby_profile/tag/software-carpentry/\">Blog posts regarding SWC/DC</a>.</p>\n<p><strong>Hosted Workshops</strong></p>\n<ul>\n<li>\n<p><a href=\"https://statonlab.github.io/2017-12-18-carpentry-workshop/\">December 18th-19th 2017, Knoxville, TN</a></p>\n<ul>\n<li>Topics covered: Unix, Git, and R </li>\n</ul>\n</li>\n</ul>\n<h5>KBRIN Next Generation Sequencing and Data Analysis Workshop, <em>University of Kentucky</em> 2017</h5>\n<p>Instructor and web developer.  Implemented and maintained the (Drupal-based workshop website)[https://ngs.csr.uky.edu/] and REDCap registration/survey system.  <a href=\"https://link.springer.com/article/10.1186/s12859-017-1781-y\">Poster publication link</a>.</p>\n<h5>UK-BLAST: <em>University of Kentucky</em> 2016</h5>\n<p>UK-BLAST is an extracurricular support group for undergraduates performing genomics research at the University of Kentucky.  In addition to advising students on their projects, I designed and implemented workshops on topics in genomics.</p>\n<h5>Departmental teaching: <em>Cornell University</em> 2008-2013</h5>\n<ul>\n<li>Spring 2008: PLPA 2010 TA: Magical Mushrooms &#x26; Mischievous Molds.</li>\n<li>Spring 2010: PLPA 2015 TA: Mushrooms, Molds and Molecules.</li>\n<li>Spring 2011 PLPA 2015 TA: Mushrooms, Molds, and Molecules.</li>\n<li>Spring 2012 PLPA 2015 TA:  Mushrooms, Molds, and Molecules.</li>\n<li>Spring 2013 PLPA 2015 TA:  Mushrooms, Molds, and Molecules.</li>\n</ul>\n<p>_ _</p>\n<h5><a href=\"http://www.cte.cornell.edu/\">Center for Teaching Excellence</a>: <em>Cornell University</em> 2011-2013</h5>\n<p><em>workshops (1 hour) developed &#x26; implemented:</em></p>\n<blockquote>\n<ul>\n<li>Classical teaching models and the psychology of learning</li>\n</ul>\n</blockquote>\n<ul>\n<li>What do I want my students to learn? Identifying learning outcomes as the basis for instruction and assessment</li>\n<li>Using library resources to enhance student’s research skills</li>\n<li>Creating effective questions for iClickers and online quizzes</li>\n<li>Establishing a professional electronic online identity</li>\n</ul>\n<p><em>Full day workshops developed &#x26; implemented:</em> </p>\n<blockquote>\n<ul>\n<li>2012 Chemistry TA training instructor</li>\n</ul>\n</blockquote>\n<ul>\n<li>2012 Teaching Excellence Practicum Instructor, CTE summer Institute</li>\n</ul>\n<h4>Presentations</h4>\n<h5>Workshops</h5>\n<ul>\n<li><a href=\"http://www.bradfordcondon.com/2017/04/17/floraCliffUpdate/\">Floracliff mushroom identification workshop</a>. Lexington, KY (2016)</li>\n<li><a href=\"https://www.agbiodata.org/working_groups/metadata_persistence_wg\">AgBioData metadata committee</a>. Salt Lake City, UT (2017)</li>\n<li><a href=\"http://www.bradfordcondon.com/2018/01/12/gmod_day_1_2018/\">GMOD Hackathon</a>, <a href=\"http://www.intlpag.org/\">Plant and Animal Genomes Conference</a>. San Diego CA (2017)</li>\n<li><a href=\"http://www.bradfordcondon.com/2018/01/17/tripal_at_pag_2018/\">Tripal 2017 Hackathon</a> Instructor, <a href=\"http://www.intlpag.org/\">Plant and Animal Genomes Conference</a>. San Diego CA (2017)</li>\n</ul>\n<h5>Talks</h5>\n<ul>\n<li>Joint Genome Institute Dothideomycete jamboree. Walnut Creek, CA (2008)</li>\n<li>Fungal Genetics Conference, secondary metabolism session. Asilomar, CA (2013)</li>\n<li>\n<p>Kentucky Food Retail Safety Conference, invited speaker on wild mushroom safety. Frankfort, KY (2016)</p>\n<ul>\n<li><a href=\"https://www.slideshare.net/BradfordCondon1/ky-retail-foodseminar\">Slides</a></li>\n</ul>\n</li>\n</ul>\n<h5>Posters</h5>\n<ul>\n<li>American Society of Plant Biologists, Boston, MA (2006)</li>\n<li>Fungal Genetics Conference, Asilomar, CA (2009)</li>\n<li>Molecular Plant Microbe Biology, Quebec City, QC (2009)</li>\n<li>Fungal Genetics Conference, Asilomar, CA (2011)</li>\n<li><a href=\"http://sops.as.uky.edu/\">University of Kentucky Society of Postdoctoral Scholars Research Symposium</a>, Lexington, KY (2017) </li>\n<li><a href=\"http://www.outreach.utk.edu/Conferences/Sustaining%20Oak%20Forests/announcement.html\">Oak Symposium</a>, Knoxville TN (2017)</li>\n</ul>\n<h2>Publications</h2>\n<h3>Accepted, In Review</h3>\n<p><strong>Condon, B.</strong>, Elliott, C, Gonzalez, J, Yun, S, Akagi, Y, Wiesner-Hanks, T, Kodama, M, Turgeon, G 2018.  Clues to an evolutionary mystery: the genes for T-toxin, enabler of the devastating 1970 Southern Corn Leaf Blight epidemic, are present in ancestral species, suggesting an ancient origin.  MPMI.</p>\n<p><strong>Condon</strong>, B, Almsaeed, A, West, J, Chen, M, Staton, M 2018.  <a href=\"https://doi.org/10.1101/328641\">Tripal Developer Toolkit</a>.  Database, In Review. doi: <a href=\"https://doi.org/10.1101/328641\">https://doi.org/10.1101/328641</a></p>\n<h3>In Review</h3>\n<p>Lumibao, C, <strong>Condon, B</strong>, Kinkel , L, May, G, Seabloom, E, Borer, E 2018.  Where you are matters: site-specific responses of fungal endophyte communities in <em>Andropogon gerardii</em> to fertilization and herbivory.  Ecology, In Review.</p>\n<h3>Peer-reviewed</h3>\n<p>Lisa Harper, Jacqueline Campbell, Ethalinda K S Cannon, Sook Jung, Monica Poelchau, Ramona Walls, Carson Andorf, Elizabeth Arnaud, Tanya Z Berardini, Clayton Birkett, Steve Cannon, James Carson, <strong>Bradford Condon</strong>, Laurel Cooper, Nathan Dunn, Christine G Elsik, Andrew Farmer, Stephen P Ficklin, David Grant, Emily Grau, Nic Herndon, Zhi-Liang Hu, Jodi Humann, Pankaj Jaiswal, Clement Jonquet, Marie-Angélique Laporte, Pierre Larmande, Gerard Lazo, Fiona McCarthy, Naama Menda, Christopher J Mungall, Monica C Munoz-Torres, Sushma Naithani, Rex Nelson, Daureen Nesdill, Carissa Park, James Reecy, Leonore Reiser, Lacey-Anne Sanderson, Taner Z Sen, Margaret Staton, Sabarinath Subramaniam, Marcela Karey Tello-Ruiz, Victor Unda, Deepak Unni, Liya Wang, Doreen Ware, Jill Wegrzyn, Jason Williams, Margaret Woodhouse, Jing Yu, Doreen Main; AgBioData consortium recommendations for sustainable genomics and genetics databases for agriculture, <em>Database</em>, Volume 2018, 1 January 2018, bay088, <a href=\"https://doi.org/10.1093/database/bay088\">https://doi.org/10.1093/database/bay088</a></p>\n<p>Gladieux, P., <strong>Condon, B. J.</strong> (co-first author), Ravel, S., Soanes, D., Maciel, J. L. N., Nhani, A., Chen, L., Terauchi, R., Lebrun, M.-H., Tharreau, D., Mitchell, T., Pedley, K. F., Valent, B., Talbot, N. J., Farman, M., and Fournier, E. 2018. Gene Flow between Divergent Cereal- and Grass-Specific Lineages of the Rice Blast Fungus <em>Magnaporthe oryzae</em>. J.W. Taylor, ed. MBio. 9:e01219–17</p>\n<p>Mohd Zainudin, N. A. I., <strong>Condon, B. J.,</strong> De Bruyne, L., Poucke, C. V., Bi, Q., Li, W., et al. (2015). Virulence, host selective toxin production, and development of three Cochliobolus phytopathogens lacking the Sfp-type 4′-phosphopantetheinyl transferase Ppt1. <em>MPMI</em> (digital preprint). doi:10.1094/MPMI-03-15-0068-R</p>\n<p>Santana, M. F., Silva, J. C. F., Mizubuti, E. S. G., Araújo, E. F., <strong>Condon, B. J.,</strong> Turgeon, B. G., &#x26; Queiroz, M. V. (2014). Characterization and potential evolutionary impact of transposable elements in the genome of <em>Cochliobolus</em> <em>heterostrophus</em>. <em>BMC Genomics</em>, <em>15</em>(1), 536. doi:10.1186/1471-2164-15-536</p>\n<p><strong>Condon, B. J.,</strong> Wu, D., Kraševec, N., Horwitz, B. A., &#x26; Turgeon, B. G. (2014). Comparative Genomics of <em>Cochliobolus</em> Phytopathogens. In R. A. Dean, A. Lichens-Park, &#x26; C. Kole, <em>Genomics of Plant-Associated Fungi: Monocot Pathogens</em> (pp. 41–67). Berlin, Heidelberg: Springer Berlin Heidelberg. doi:10.1007/978-3-662-44053-7_2</p>\n<p><strong>Condon, B. J.,</strong> Oide, S., Gibson, D. M., Krasnoff, S. B., &#x26; Turgeon, B. G. (2014). Reductive iron assimilation and intracellular siderophores assist extracellular siderophore-driven iron homeostasis and virulence. <em>Molecular Plant-Microbe Interactions : MPMI</em>, <em>27</em>(8), 793–808. doi:10.1094/MPMI-11-13-0328-R</p>\n<p>Horwitz, B. A., <strong>Condon, B.</strong>, &#x26; Turgeon, B. G. (2013). Cochliobolus heterostrophus: A Dothideomycete Pathogen of Maize. In <em>Genomics of Soil-and Plant-associated Fungi</em> (Vol. 36, pp. 213–228). Berlin, Heidelberg: Springer Berlin Heidelberg. doi:10.1007/978-3-642-39339-6_9</p>\n<p>Zhang, N., MohdZainudin, N. A. I., Scher, K., <strong>Condon, B. J.,</strong> Horwitz, B. A., &#x26; Turgeon, B. G. (2013). Iron, oxidative stress, and virulence: roles of iron-sensitive transcription factor Sre1 and the redox sensor ChAp1 in the maize pathogen <em>Cochliobolus heterostrophus</em>. <em>Molecular Plant-Microbe Interactions : MPMI</em>, <em>26</em>(12), 1473–1485. doi:10.1094/MPMI-02-13-0055-R</p>\n<p><strong>Condon, B. J.,</strong> Leng, Y., Wu, D., Bushley, K. E., Ohm, R. A., Otillar, R., et al. (2013). Comparative genome structure, secondary metabolite, and effector coding capacity across <em>Cochliobolus</em> pathogens. <em>PLoS Genetics</em>, <em>9</em>(1), e1003233. doi:10.1371/journal.pgen.1003233</p>\n<p>Xue, C., Wu, D., <strong>Condon, B.</strong>, Bi, Q., Wang, W., &#x26; Turgeon, B. G. (2013). Efficient gene knockout in the maize pathogen <em>Setosphaeria turcica</em> using <em>Agrobacterium tumefaciens</em>-mediated transformation. <em>Phytopathology</em>, <em>103</em>(6), 641–647. doi:10.1094/PHYTO-08-12-0199-R</p>\n<p>Ohm, R. A., Feau, N., Henrissat, B., Schoch, C. L., Horwitz, B. A., Barry, K. W., <strong>Condon, B. J.,</strong> et al. (2012). Diverse lifestyles and strategies of plant pathogenesis encoded in the genomes of eighteen Dothideomycetes fungi. <em>PLoS Pathogens</em>, <em>8</em>(12), e1003037. doi:10.1371/journal.ppat.1003037</p>\n<p>Turgeon, B. G., <strong>Condon, B. J</strong>., Liu, J., &#x26; Zhang, N. (2010). Protoplast transformation of filamentous fungi. <em>Methods in Molecular Biology (Clifton, N.J.)</em>, <em>638</em>(Chapter 1), 3–19. doi:10.1007/978-1-60761-611-5_1</p>\n<p>Almeida, N. F., Yan, S., Lindeberg, M., Studholme, D. J., Schneider, D. J., <strong>Condon, B. J.,</strong> et al. (2009). A draft genome sequence of <em>Pseudomonas syringae</em> pv. tomato T1 reveals a type III effector repertoire significantly divergent from that <em>of Pseudomonas syringae</em> pv. tomato DC3000. <em>Molecular Plant-Microbe Interactions : MPMI</em>, <em>22</em>(1), 52–62. doi:10.1094/MPMI-22-1-0052</p>","frontmatter":{"title":"CV and contact"}}},"pageContext":{"slug":"/cv/"}}