{"data":{"markdownRemark":{"html":"<p>I’m excited to announce that my wife <a href=\"https://evcrockerblog.wordpress.com/\">Dr. Ellen Crocker</a> and I will be teaching a workshop at the <a href=\"http://www.floracliff.org/fieldstudies.html\">Floracliff Nature Sanctuary</a> on Friday and Saturday, October 14th-15th 2016.  I’m particularly proud to partner with Floracliff: it’s a beautiful nature preserve with very cool educational opportunities available to the public.  Ellen has taken Rob Paratley’s fern workshop and she said it was fantastic.</p>\n<p>No promises, but our last foray into the Daniel Boone National Forest was beautiful, and yielded a pound or two of some nice chanterelles.</p>\n<p><img src=\"/wp-content/uploads/2016/08/IMG_2027.jpg\" alt=\"Chanterelles\"></p>\n<blockquote>\n<p>Wild chanterelles harvested this summer in Kentucky.  Chanterelles are an example of an easy to identify edible wild mushroom.  The only poisonous look-a-like to the chanterelle is the Jack O'Lantern mushroom.  Beginning mushroom hunters will learn that chanterelles have false gills, unlike the Jack O’Lantern.  Additionaly, Jack O’Lanterns tend to grow in dense clusters, whereas chanterelles emerge distinctly. </p>\n</blockquote>\n<p>While the workshop is full, please think about signing up for the waitlist or contacting me to hear more about future mushroom forays.</p>\n<p>Participants can expect to learn the basics of fungal biology, the many ways in which fungi participate in their communities, and the principles of fungal identification.  We don’t claim to be mushroom identification experts (in fact we are routinely humbled when attending mycological forays).  However, we are trained mycologists who can teach you to appreciate the different types of fungi and the tools used to identify them.</p>\n<p>While we will talk about identification of wild mushrooms, collecting and eating wild mushrooms can be a dangerous, even deadly, past time.  In fact, <a href=\"https://www2.ca.uky.edu/agcollege/plantpathology/ext_files/PPFShtml/PPFS-GEN-14.pdf\">Ellen has written an excellent fact sheet on the dangers of wild mushroom consumption.</a>  I would recommend that novice mushroom hunters consult with an expert until they are extremely confident in their mushroom identification.  Even then, novice hunters should set aside 1 or 2 mushrooms if they plan to consume them.  This will be extremely useful for identifying the consumed mushroom in the event of an unintentional poisoning.</p>\n<p> </p>\n<p>A tentative itinerary can be found <a href=\"http://www.floracliff.org/miscdocs/FFS_Mushrooms2016.pdf\">here.</a></p>","frontmatter":{"title":"Upcoming workshop: Mushrooms 101 at Floracliff Nature Sanctuary"}}},"pageContext":{"slug":"/2016-08-25-upcoming-workshop-mushrooms-101-at-floracliff-nature-conservatory/"}}