{"data":{"markdownRemark":{"html":"<h1>introduction</h1>\n<p>I hosted my first Software Carpentry workshop on December 18th and 19th 2017 in Knoxville Tennessee with my co-instructors Meg Staton and Drew Steen.</p>\n<p>I tried to follow the general recommendations and most things worked out great.  Here are some lessons learned.</p>\n<p><img src=\"/gatsby_profile/img/carpentry/s_carp.png\" alt=\"The Software Carpentry logo\"></p>\n<h2>Preparation</h2>\n<h3>Consider digital and print flyers</h3>\n<p>I liked the inclusion of \"tear off\" tags for our flyer workshop.  When I saw it on this digital display, I had to laugh.  Next time we'll distribute <em>print</em> and <em>digital</em> versions of the flyer.</p>\n<blockquote>\n<p><img src=\"/gatsby_profile/img/carpentry/swc_flyer_tearoff.jPG\" alt=\"Our flyer\">\nOur flyer had tear offs which sounds great until you see it on one of those digital bulletin board displays around campus.</p>\n</blockquote>\n<h3>Charging a registration fee</h3>\n<p>The Software Carpentry recommends charging a nominal registration fee to reduce no-shows.  Unfortunately this added a layer of administrative red tape for us, so we kept registration free.  How did that work out for us?</p>\n<p>Well, we sold out for 35 tickets within 24 hours, with a waitlist of 25.  I emailed out a week before and 72 hours before asking for people to cancel if they could not make it.  This netted me 11 cancellations, but the workshop started on a Monday!  This meant that most waitlisters were notified over the weekend and did not end up claiming their tickets.  This is in addition to the five students who no-showed without notice.</p>\n<p>So ultimately we ended up with 31 out of 35 seats filled, which isn't so bad.</p>\n<h3>Using Eventbrite</h3>\n<p>Because our workshop was free, there was no fee for using Eventbrite.  Eventbrite provides the basic functions necessary to manage the event: you can download an attendee list including email, or you can contact attendees via Eventbrite.</p>\n<p>Eventbrite also has a waitlist functionality.  After the tickets sold out, I enabled the waitlist and people could join the waitlist, managed entirely by Eventbrite.  When I received cancellations, I just had to \"release the tickets\" and the waitlister has a set period of time (i set it to 24 hours) to respond and claim their ticket.</p>\n<p>Eventbrite also has a widget that lets participants purchase tickets right on your course website.</p>\n<blockquote>\n<p><img src=\"/gatsby_profile/img/carpentry/eventbrite_widget.png\" alt=\"The Eventbrite widget on our software carpentry website\">\nThe Eventbrite widget will allow your users to purchase tickets right on your website (or in this case, join the waitlist).  </p>\n</blockquote>\n<p>All together this is great.  Managing an attendee list and waitlist via emails is a deceptively time consuming task.  Even though its quite easy, not getting barraged with emails (almost 70 emails with people registering alone!) is a great perk.  I would use Eventbrite again, at least for free events.</p>\n<blockquote>\n<p><img src=\"/gatsby_profile/img/carpentry/eventbrite.png\" alt=\"The Eventbrite page\">\nThe Eventbrite event management page.</p>\n</blockquote>\n<h3>Preparing Your Lectures</h3>\n<ul>\n<li>Pre-generate your ether pad with questions.  I am sharing my pre-generated etherpads: Unix, R, Git</li>\n<li>Create slides for the images in the material.</li>\n<li>Look at the github repo for the lessons and know the issues and alternatives.</li>\n</ul>\n<p>The carpentry workshops are live code only without slides.  The thing is, graphics are great for mental models, and slides can help with instructor pacing a lot better than the free-text of the lesson plans.</p>\n<p>The open-source nature of Software Carpentry materials means that people have all sorts of suggestions for how to do things differently.  Some lessons may have variants available online that you will prefer.  The Git lesson, for example, is command-line heavy.  </p>\n<h2>Day of suggestions</h2>\n<ul>\n<li>Share links liberally.  In the chatbox of etherpad, on the website, within each etherpad.  Link to data downloads, the etherpads, the course website.</li>\n<li>Encourage your students to share a bit about themselves and why they are attending.  If the workshop is too big to do this verbally, do it digitally.  Knowing what your students expect to learn can help you trim topics if (when) you run out of time.</li>\n<li>Plan on running out of time!  The Software Carpentry workshops have time estimates but they are beyond optimistic.</li>\n</ul>","frontmatter":{"title":"Lessons From Planning My First Software Carpentry Workshop"}}},"pageContext":{"slug":"/2017-12-18-12-18-17_swc_lessons/"}}