{"data":{"markdownRemark":{"html":"<p>Welcome to Tripal Country!</p>\n<p><img src=\"/gatsby_profile/img/TripalLogo_dark.png\" alt=\"Tripal Logo\"></p>\n<p>This is a short guide to demonstrate how to create new bundle types with Chado storage in Tripal 3. It was originally written as instructions for my <a href=\"https://github.com/statonlab/tripal_alchemist/\">Tripal Alchemist module</a>.  There is a similar guide <a href=\"http://tripal.info/tutorials/v3.x/content-types\">on tripal.info</a> which you can also review.</p>\n<h2>Quick Guide</h2>\n<ul>\n<li>Pick an appropriate CVterm for your bundle.  I recommend using the <a href=\"https://www.ebi.ac.uk/ols/index\">EBI Ontology Lookup Service</a>.</li>\n<li>If not already in Chado, insert the CVterm.</li>\n<li>Match your new bundle to the CVterm.</li>\n<li>Set the Storage backend to Chado.</li>\n<li>Select the appropriate Chado Table.</li>\n<li>Determine if this term is the exclusive user of this Chado table.  If it is, you can select \"Yes\" when asked if all records in the Chado table will be of this type, and press \"Create Content Type\".</li>\n<li>if the Chado Table is shared, select the appropriate method for distinguishing content types. This will either be a <em>property table</em> or a <em>type_id</em> column in the base table.</li>\n<li>If using a property table, specify a property type cvterm.</li>\n<li>Select the matching property value to distinguish this type.</li>\n</ul>\n<h2>Detailed Guide</h2>\n<p>For the purposes of this demo, let us assume that we have a custom module for storing proteomic analyses.  Our module had a custom node, analysis_proteome, and after migrating to Tripal 3, all those nodes were converted to one generic analysis type.</p>\n<h3>Picking a CVterm</h3>\n<p>Before we begin, let's pick an appropriate CVterm for our bundle.  The ideal term will be specific enough to not overlap with other content, but broad enough to work for other users who might download your module.  For example, we wouldn't want to say \"flatworm proteome analysis\" when \"proteome analysis\" works just as well.\nI recommend using the <a href=\"https://www.ebi.ac.uk/ols/index\">EBI Ontology Lookup Service</a>.  In our case, I've found a reasonable term in the OBI ontology: <a href=\"https://www.ebi.ac.uk/ols/ontologies/obi/terms?iri=http%3A%2F%2Fpurl.obolibrary.org%2Fobo%2FOBI_0000615\">protein expression profiling\n</a>.</p>\n<p>Next, make sure the term is in your database.  If you've already loaded the entire CV or ontology you found your term in, you can skip this step.  Otherwise, go to /admin/tripal/loaders/chado<em>vocabs/chado</em>cvterms in the admin menu and select <strong>+ Add Term.</strong>  Be sure to fill out the CV, DB, accession, and Term Name fields correctly: for a detailed guide on this topic, please see <a href=\"https://github.com/statonlab/fields_generator/blob/master/CV_guide.md\">the guide available in the Tripal Fields Generator Tool</a>.</p>\n<blockquote>\n<p><img src=\"/gatsby_profile/img/tripal/bundle_creation/create_bundle_2_cvterm.png\" alt=\"admin location of adding a content type\">\nAfter finding an appropriate CVterm, use the chado cvterm loader to insert it if not already present in your database.</p>\n</blockquote>\n<p>A note: if you are stumped, or can't seem to find a good CVterm, you can use the local CV, but this is discouraged.   </p>\n<h3>Bundle Creation</h3>\n<p>Now that we have a CVTerm for our bundle, let's add it to Tripal.  You can add a new Tripal Content Type (Bundle) by navigating to Structure -> Tripal Content Types -> Add Tripal Content Type in the admin menu.  To fill out this form, we need to know our CVterm, what Chado base table our bundle uses, and how the content type is differentiated if the table is shared.  In the case of our demo Protein Expression Profiling bundle, we know that it is one of several content types using the <em>Analysis</em> Chado base table. </p>\n<blockquote>\n<p><img src=\"/gatsby_profile/img/tripal/bundle_creation/create_bundle_1.png\" alt=\"admin location of adding a content type\"></p>\n<p>You can create new Tripal Content Types (bundles) via the admin panel by navigating to Structure -> Tripal Content Types. </p>\n</blockquote>\n<blockquote>\n<p><img src=\"/gatsby_profile/img/tripal/bundle_creation/create_bundle_lookup_bundle_term.png\" alt=\"Look up the bundle term\">\nFirst, assign your term to your bundle.  You should have a term in the <em>Matching Terms</em> box after pressing Lookup Term.</p>\n</blockquote>\n<p>There are three possible storage configurations for your bundle.</p>\n<ol>\n<li>Your bundle is the only content type mapped to this base table.  If you don't need special functionality or fields for any subtype, this is the best choice.</li>\n<li>Your bundle shares the base table, and is distinguished by a <em>type_id</em> column.  If this is the case, your chado base table will have a <em>type_id</em> column that holds a cvterm_id foreign key.  That cvterm will be the type.</li>\n<li>Your bundle shares the base table, and is distinguished by a <em>linker table</em>.  For the analysis table, this could be <code class=\"language-text\">analysisprop</code>, but it could also be <code class=\"language-text\">analysis_cvterm</code>.</li>\n</ol>\n<p>Tripal will <strong>automatically make suggestions</strong>for where to store the type based on your Chado schema.</p>\n<blockquote>\n<p><img src=\"/gatsby_profile/img/tripal/bundle_creation/create_bundle_set_storage_properties.png\" alt=\"Set the property type values\">\nIn this example, we specify our bundle type in the analysisprop table.  There is a property associated with our analysis via this table where the type<em>id matches the cvterm we specify (Analysis Type), and the corresponding value should be tripal</em>protein_expression.</p>\n</blockquote>\n<p>For our Protein Expression Profiling bundle, we want to use the <code class=\"language-text\">analysisprop</code> table.  Tripal (and Tripal Alchemist!) will look for entries in the analysis table that have a property in the analysisprop table where type<em>id = the cvterm for the type (Analysis Type in this case).  Tripal will know that the analysis is a Protein Expression Profiling if the <code class=\"language-text\">value</code> column of that property is equal to the text we specified: `tripal</em>protein_expression`.  For analyses created by modules, this is the convention: set the Analysis Type cvterm equal to the <em>module name</em>.</p>\n<h3>Populating our Bundle</h3>\n<p>Now that our bundle exists, we can create new content directly by going to Content -> Tripal Content -> + Add Tripal Content.</p>\n<p>If you've already got Tripal 2 nodes for your content, you can migrate them using the core migrator available at Tripal -> Data Storage -> Chado -> Migrate.  Analyses will all migrate to the Analysis content type, so you can use <a href=\"https://github.com/statonlab/tripal_alchemist/\"><strong>Tripal Alchemist</strong></a> to migrate your content <em>from</em> Analysis <em>to</em> the new bundle type.  For our demo, this would be Protein Expression Profiling.</p>","frontmatter":{"title":"Tripal Country: Manually Creating New Bundle Types"}}},"pageContext":{"slug":"/2018-02-01-tripal_manually_creating_bundles/"}}