{"data":{"markdownRemark":{"html":"<p>As a Tripal developer, one of the fun things I get to do is contribute not only to the Tripal project, but also other parts of GMOD, the <a href=\"http://gmod.org/wiki/Main_Page\">Generic Model Organism Database Project</a>.  I attended the January 10th 2018 GMOD hackathon at the <a href=\"http://www.intlpag.org/2018/program/program-overview\">Plant and Animal Genome XXVI conference</a> hoping to make a few small changes to Chado, the SQL database schema that <a href=\"http://hardwoodgenomics.org/\">HardwoodGenomics</a> uses with Tripal.</p>\n<p><img src=\"/assets/img/gmod/GMOD.png\" alt=\"GMOD\">\n<img src=\"/assets/img/gmod/chado_logo.png\" alt=\"CHADO\"></p>\n<!--more-->\n<p>It was a really great day and I learned a lot about both Chado and SQL working with Stephen Ficklin, Scott Cain, and Emily Grau (others were in attendance, this was the Chado team).  </p>\n<p>I wanted to outline a bit of what we accomplished and what it means for the 1.4 Chado release!  Check out the current progress and issues on <a href=\"https://github.com/GMOD/Chado\">the project GitHub</a>.</p>\n<h2>Conquering Issues</h2>\n<p>We actually had a backlog of issues tracked in a <a href=\"https://docs.google.com/document/d/1t_Jb4XxUPtgGRSKtznsqvjTjmR4vpFHPQROMQ0OZK9A/\">google spreadsheet</a>, so the first order of business was to convert those into Github issues to easier delegate and discuss them.  Thinking about all of these issues for modules I had never used was really helpful in understanding Chado holistically, rather than as a ruleset I stuck my data into for no good reason.</p>\n<p>Learn about pushing out a new version of Chado!  It's a bunch of perl scripts that combine all the modules into a single SQL file.</p>\n<h2>New In Chado v1.4</h2>\n<p>This list may continue to grow, but I was able to make the following contributions at the meeting!</p>\n<ul>\n<li>CVterm for prop values not just type</li>\n<li>Update the MAGE module table descriptions to describe expression data from not just Microarray experiments but Next Generation Sequencing, and hopefully future methods as well.</li>\n<li>Type_id added to analysis table</li>\n<li>New linker tables biomaterial<em>project and stock</em>biomaterial</li>\n<li>Reached out to the community regarding the eimage table and all proposed linker tables</li>\n</ul>\n<p>I'd like to talk a little more about the Controlled Vocabulary term (CVterm) prop values issue, because I think it's a great improvement to Chado, especially as Tripal 3 embraces associating all content with CVterms.</p>\n<h2>CVterm Support for Values</h2>\n<p>We <a href=\"https://github.com/GMOD/Chado/issues/26\">created a <strong>cvalue_id</strong> column for all prop tables</a>!  This sounds like a simple change but it's awesome.  Right now, if you have a property set, what it does is describe an Chado record with a CVterm and a value.  That value is free text.  Now, you can choose to specify a cvalue_id (cvterm value id) instead of free text.</p>\n<p>What does this actually mean?</p>\n<p>Imagine I am entering Biological samples into my Chado database, and I want to assign a record property for the tissue the sample was collected from.  I would use the CVterm tissue, and a value that says what tissue: leaf, bud, flower, stem, root.  Only tissue gets a CVterm: the others are free text!  Now I can easily leverage, say, the <a href=\"http://www.obofoundry.org/ontology/to.html\">Plant Trait Ontology</a>, so I can use a Cvterm to set not just tissue by the tissue value!</p>\n<p>The Tripal Analysis Expression module currently allows you to assign biosample property types to CVterms.  With this change, I look forward to implementing property <strong>value</strong> CVterm assignment as well.</p>\n<p>As we keep on working on v1.4, hopefully I can write more posts on Chado updates and what Tripal developers need to know.</p>","frontmatter":{"title":"Chado 1.4 at the 2018 GMOD hackathon"}}},"pageContext":{"slug":"/2018-01-12-gmod_day_1_2018/"}}