{"data":{"markdownRemark":{"html":"<p>This guide will demonstrate using the <a href=\"https://github.com/statonlab/tripal_hq\">Tripal HeadQuarters (HQ) module</a>.</p>\n<h2>The datasets module inspired Tripal HQ</h2>\n<p>The <a href=\"https://github.com/NAL-i5K/tripal_chado_datasets\">Tripal Chado Dataset</a> module is a standalone module that allows users to submit Chado analysis record requests to a Tripal site. It provides a submission form, admin interface, and email notifications.</p>\n<p>Working to genericize this module for use on other sites, I realized we could leverage Tripal 3 entities to handle the submission form.  Doing so would allow us to support any and all Tripal content, regardless of its configuration.  This would prevent a lot of duplication of effort, as the datasets module manually creates the user submission form and all of its fields.  What if another site wants to require different information for submissions?  They would have to use <code class=\"language-text\">hook_form_alter</code>, but the data was stored in a custom table expecting each field as a column: the schema would have to change too!  We needed a better way.</p>\n<p>Tripal HQ provides a user-contributed content control center and administrative toolbox for your Tripal site. This means that users are able to create whatever Chado content you'd like them, but withhold inserting it into the database until someone has approved it.</p>\n<h2>Approach</h2>\n<p>Tripal HQ will handle the emails, as well as the user and admin dashboards.  All that we need to do is configure our Organism bundle to be suitable for user input.  If you need a primer on Tripal organisms, please see the <a href=\"https://tripal.readthedocs.io/en/latest/user_guide/example_genomics/organisms.html\">Tripal user's guide</a>.</p>\n<h3>Simple case: Organism</h3>\n<p>Let's look at the <code class=\"language-text\">tripal_chado_datasets</code> organism form:</p>\n<p><img src=\"/img/datasets_to_hq_2018/datasets_organism.png\" alt=\"datasets organism\"></p>\n<p>We want the create organism form to look similar to this, but to do it we'll have to remove a bunch of fields and add some new ones.</p>\n<p>Here's what we are going to do:</p>\n<ul>\n<li>Remove excess fields</li>\n<li>Add in new fields as properties</li>\n</ul>\n<h3>Remove unfriendly fields</h3>\n<p>Understand that the organism bundle on your site had fields added based on Chado's layout for an analysis(<a href=\"https://laceysanderson.github.io/chado-docs/tables/organism.html\">https://laceysanderson.github.io/chado-docs/tables/organism.html</a>).  The organism base table has an abbreviation, genus, species, common<em>name, infraspecific</em>name, type_id, and comment field.</p>\n<p>We can see that there is indeed a field for each of these, found at <strong>Structure -> Tripal Content Types -> Organism -> Manage Fields</strong>.</p>\n<p>Additional fields, such as publication and annotation, get attached automatically due to <strong>linker tables</strong> such as <a href=\"https://laceysanderson.github.io/chado-docs/tables/organism_pub.html\">analysis pub</a> and <a href=\"https://laceysanderson.github.io/chado-docs/tables/organism_cvterm.html\">analysis cvterm</a>.</p>\n<p>The first step is deciding which of these fields we can safely hide from users.  Note that the Organism table has a <a href=\"https://laceysanderson.github.io/chado-docs/tables/organism.html#Indexes\">constraint</a>: the genus, species, type_id, and infraspecific name columns <strong>must be unique</strong> in the database.  It's therefore a good idea to not hide these widgets from our users, unless we don't plan to make use of the type and infraspecific name at all.</p>\n<h4>Removing cross reference fields</h4>\n<p>Some of the default Tripal fields can be tough for visitors on a site, who don't necessarily know anything about Tripal.  The Annotations field, for example, is pretty open-ended: how would a user know what types of annotations to add?  The publication and cross reference widgets (Drupal's word for the field's input box) are more straight forward, but require the records to <strong>already exist in the database</strong>: this is likely to be confusing for someone trying to tag their submission with a publication!</p>\n<p>Fortunately, we can use the <strong>Drupal Field Permission</strong> module to hide these fields from our users.  I've already written a <a href=\"https://tripal.readthedocs.io/en/latest/user_guide/content_types/field_permissions.html\">guide for how to use field-specific permissions</a> on the Tripal documentation: follow that guide to configure permissions os these widgets only appear for admins.</p>\n<h4>Adding in new property fields</h4>\n<p>Now that we've greatly simplified our organism form, let's add in the questions we want end users to be answering.</p>\n<p><strong>NCBI Taxonomy ID</strong>  This field is a special case.  Because it refers to this organism in another database, it is supposed to go in <code class=\"language-text\">dbxref</code>.  However, asking users to fill out the cross reference field is too much.  For now, we'll add it as a property, but look for a custom field in the future that <strong>only associates an organism with the NCBI taxonomy ID</strong>.</p>\n<p>First, we need an ontology term. The <a href=\"https://www.ebi.ac.uk/ols/index\">EBI Ontology Lookup Service</a> is a fantastic resource for finding terms.</p>\n<p>Luckily we have a great term from the EDAM, which Tripal makes extensive use of: <a href=\"https://www.ebi.ac.uk/ols/ontologies/edam/terms?iri=http%3A%2F%2Fedamontology.org%2Fdata_1179\">data:1179</a>.  If EDAM isn't fully loaded on your site, insert the term manually (go to <code class=\"language-text\">admin/tripal/loaders/chado_vocabs/chado_cvterms</code>).</p>\n<p>Once we have a term, create a new field of type Chado Property (Note: Chado properties create their own fields!  So if you already have an <code class=\"language-text\">organismprop</code> in the database, you shouldn't have to perform this step.).</p>\n<p>For this field settings, be sure to select the CVterm we chose above.  Set the number of values to 1, or, unlimited, depending on your usage.  Be sure to fill out the Help Text box as desired.  We'd also like to make this field required: check the <strong>Required Field</strong> box.</p>\n<h5>Fields that shouldn't go in the database</h5>\n<p>This field really shouldn't go in Chado, but we might still want to ask users:</p>\n<blockquote>\n<p>Briefly describe your plans for this genome project (e.g. are you interested in community curation?). *</p>\n</blockquote>\n<p>We'll therefore attach it as a <strong>regular Drupal Field</strong>.</p>\n<ul>\n<li>Insert a term for the field (I'm using local:submitter_plans)</li>\n<li>Create a new field of type long text</li>\n<li>Set the term to our submitter_plans term</li>\n<li>Be sure to set up the help text with the message you want users to see.</li>\n<li>After saving the field, leave the display disabled: we don't want this showing up on the organism page!</li>\n</ul>\n<p><img src=\"/img/datasets_to_hq_2018/long_text_field.png\" alt=\"Adding the plain text field\"></p>\n<p>We don't want to display this field, so leave the formatter disabled.</p>\n<p>The same is true for some of the other questions: for example, \"Were you involved in the generation of this genome assembly?\".  In this case, however, a textfield isn't appropriate: instead, let's use a boolean.  I use the term <code class=\"language-text\">local:user_assembled_organism_genome</code> for this field.  For the widget, a single on /off checkbox is appropriate.</p>\n<p><img src=\"/img/datasets_to_hq_2018/user_submit_genome.png\" alt=\"Adding the plain text field\"></p>\n<h3>Configure display</h3>\n<p>Now we just have some final touches.  Be sure to drag and reorder the fields in a manner which makes the most sense for your users.</p>\n<p>I changed the boolean checkbox to use the label for the display and reordered my fields.  This is the end result:</p>\n<p><img src=\"/img/datasets_to_hq_2018/final_org_widget_display.png\" alt=\"Final organism widget\"></p>\n<p>This field configuration can be exported with the Drupal Feature module: see my guide on doing so <a href=\"https://www.bradfordcondon.com/2018-11-09-understanding_drupal_features/\">here</a>.</p>\n<h2>Managing user submissions with HQ</h2>\n<p>Next, we need to set up HQ.  This means:</p>\n<ul>\n<li>giving permission to a user role for submitting HQ content for Organism</li>\n<li>(optional) giving permission to a user role for approving HQ content</li>\n</ul>\n<p>Once HQ is set up, user submissions will appear in the admin dashboard.</p>\n<p><img src=\"/img/datasets_to_hq_2018/admin_dash.png\" alt=\"admin dash\"></p>\n<p> The admin can click on the title to edit and view the submission, or click on approve to create the record.  Once the submission is approved, it will be entered into Chado, and a Tripal entity will be created associated with it.  Furthermore, HQ handles email events, and will notify users and admins of pending creation requests and their resolution.</p>\n<p>This field display is available for download <a href=\"https://github.com/NAL-i5K/tripal3_organism_layout\">on GitHub here</a>.</p>","frontmatter":{"title":"Configuring Analysis for User Submission with Tripal HQ"}}},"pageContext":{"slug":"/2018-11-19-dataset_submission_guide/"}}