{"data":{"markdownRemark":{"html":"<h2>Switching to Jekyll</h2>\n<p>This weekend I switched my site from a Wordpress site hosted by bluehost to a Jekyll site hosted on githubpages.  I'm excited about this for plenty of reasons.</p>\n<ul>\n<li>Free hostings on GithubPages</li>\n<li>Manage all aspects of the site, including layout and posts, on github</li>\n<li>Write in Markdown</li>\n<li>Use R plugins to script in R Markdown (I'll share my experience with this later!)</li>\n<li>An excuse to practice CSS and Ruby</li>\n</ul>\n<p>It's pretty win-win.</p>\n<p>If you're looking to try this out for yourself, you'll want Ruby/RVM, Jekyll, and github set up.</p>\n<h2>Migrating my old Wordpress posts</h2>\n<p><a href=\"http://ben.balter.com/\">Ben Balter</a> has created a Wordpress plugin that exports existing posts to Jekyll Markdown.</p>\n<p>It's simple: download and enable the plugin, then use the <code class=\"language-text\">export to Jekyll</code> command on the toolbar. </p>\n<p>All of my Wordpress posts are now neatly in my <code class=\"language-text\">_posts</code> folder, and all associated assets are in <code class=\"language-text\">wp-content/uploads/[date]/</code>.  I need to cull some of the images to cut down on space, and I have to redo the formatting of my old Wordpress posts.  For example, the MD headers have more info than we would possibly care about (such as review requests) and there are some wonky tags in the pages.  All in all, though, this works extremely well.</p>\n<h2>Working with drafts</h2>\n<p>I suggest reading through the Jekyll docs, but the simple gist is that we'll write our posts directly in Markdown as drafts in <code class=\"language-text\">_drafts</code>.  Executing <code class=\"language-text\">jekyll serve --drafts</code> </p>\n<p><a href=\"http://www.hongkiat.com/blog/jekyll-plugin/\">This post on Hongkiat's blog</a> pointed me to a plugin created by <a href=\"http://jeffreysambells.com/\">Jeffrey Sambells</a>. </p>\n<p>We write posts in the <code class=\"language-text\">_drafts</code> folder, and mark them as <code class=\"language-text\">date: unpublished</code> in the header (note that having <code class=\"language-text\">unpublished</code> posts in <em><code class=\"language-text\">drafts</code> folder will mess with running the --draft server.  I recommend just commenting the line out until moving to `</em>publish`)</p>\n<p> So,</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">---\nlayout: post\ntitle: &quot;Moving to Jekyll&quot;\n &lt;!-- date: unpublished --&gt;\n---\n\n# Introduction\n\nThis is my post that I get to write in *Markdown*!  </code></pre></div>\n<p>When we're ready to publish the post, we move it to the <code class=\"language-text\">_publish</code> folder (and uncomment the date).  Our plugin will fix the date and move it to the <code class=\"language-text\">_posts</code> folder.</p>\n<h2>Configuring the site layout</h2>\n<p>Hooboy.  As someone who has almost zero experience doing this, I'd recommend starting with an existing Jekyll theme if you feel overwhelmed.  If not, pick a CSS framework and mess around, there's no better way to learn.  You can always use <a href=\"https://github.com/bradfordcondon/bradfordcondon.github.io\">this site as a starting point</a> if you're totally lost.</p>\n<h2>Start posting!</h2>\n<p>I'm really hopeful that The joy of writing in Markdown (and R Markdown) will get me back in the blogging game.</p>","frontmatter":{"title":"Moving to Jekyll"}}},"pageContext":{"slug":"/2017-04-09-introToJekyll/"}}