{"data":{"markdownRemark":{"html":"<p>In a <a href=\"/2017/09/25/Software_Data_Carpentry/\">previous blog post</a>, I announced my excitement for becoming a certified Software and Data Carpentry instructor.  As I complete my checkout process, I also wanted to recap the most important points from the training.  <a href=\"https://docs.google.com/presentation/d/e/2PACX-1vQDtbUsYpFS5-I_66uKSixgSKQSSWrQSlmkZ9HdMMiKY8U449nyFwDkzQ14WAEDYf4xiFaZRV70xX9A/pub?start=false&#x26;loop=false&#x26;delayms=3000\">A lab meeting presentation of this recap cis available on google slides here</a>.  </p>\n<p>Looking forward to teaching my first workshop in the next few months!</p>\n<p><img src=\"/gatsby_profile/img/carpentry/d_carp.png\" alt=\"Data Carpentry\"> <img src=\"/gatsby_profile/img/carpentry/s_carp.png\" alt=\"Software Carpentry\"></p>\n<h1>Teaching Techniques</h1>\n<p>The current goal in higher education is to create an <a href=\"https://teachingcommons.stanford.edu/resources/learning-resources/promoting-active-learning\">active learning environment</a> in the classroom.  This is not new, and in fact I spent 2 years working with the <a href=\"https://www.cte.cornell.edu/\">Cornell Center for Teaching Excellence</a> designing workshops using this philosophy.  Often, higher education utilizes passive learning environments.  The professor is the expert, and they lecture for 50 minutes alongside powerpoint slides.  This format is easy to teach, it matches the traditional academic presentation style, and its fairly easy to prepare because the instructor focuses on the question: <strong>\"What material should I cover?\"</strong>  </p>\n<h2>Learning Objectives</h2>\n<p>A wonderful outcome of active learning is that the instructor is encourage to instead ask <strong>\"What should the outcome of this lesson be?\"</strong>  These outcomes are called <a href=\"https://www.cmu.edu/teaching/designteach/design/learningobjectives.html\">learning objectives</a>, and without them, you are teaching just to cover material.  Learning Objectives describe what your students will be able to <strong>do</strong> after finishing the lesson.  Learning objectives can be foundational (recite this fact, describe this model) or higher order (choose and apply the correct model to solve a real world problem).</p>\n<p>It should be no surprise that Software and Data Carpentry workshops clearly state their learning objectives at the start of each lesson: communicating these to your students is very helpful!   </p>\n<h2>The Human Brain</h2>\n<p><img src=\"https://upload.wikimedia.org/wikipedia/commons/c/ca/Memory_module_DDRAM_20-03-2006.jpg\" alt=\"RAM\"></p>\n<blockquote>\n<p>The human brain has limited space for short term memory, not unlike Random Access Memory (RAM) in a computer.</p>\n</blockquote>\n<p>Software and Data Carpentry subscribes to a model of working memory with limited cognitive load.  Your working memory is fast and effective, but small.  To test the limits of your working memory, you can take <a href=\"https://cat.xula.edu/thinker/memory/working/serial\">this test</a>.</p>\n<p>   Most people can remember 5-7 things in the above exercise, give or take.  Keep in mind that for true novices, every piece of a single concept will constitute one \"thing\"!  Picking one higher order learning objective per lesson, and including the foundational skills required to achieve it, will almost always meet, or exceed, this limit.</p>\n<h2>Evaluations</h2>\n<p>When we think of school, we think tests.  Tests are a great form of evaluation, but they should just be the tip of the iceberg.  Sprinkling a lesson with evaluations has many benefits, such as :</p>\n<ul>\n<li>Gives students a chance to \"handle\" the content, improving retention</li>\n<li>Corrects student misconceptions</li>\n<li>Tests for gaps in lesson plan</li>\n<li>Slows down instruction, giving students time to process and <strong>retain</strong> information.</li>\n</ul>\n<h2>Activities</h2>\n<p>Prudent use of in-class activities will allow you to <em>evaluate your students' learning</em> while also <em>working to overcome the limits of short term memory</em>.  </p>\n<p>In-class activities include all of the following examples:  </p>\n<ul>\n<li>Show of Hands</li>\n<li>Multiple Choice</li>\n<li>Short answer reflection</li>\n<li><a href=\"http://www.readingrockets.org/strategies/think-pair-share\">Think-Pair-Share</a></li>\n</ul>\n<h1>Technology</h1>\n<p><img src=\"http://etherpad.org/gatsby_profile/img/screenshot.png\" alt=\"etherpad\"></p>\n<blockquote>\n<p>etherpad is an excellent group notepad.</p>\n</blockquote>\n<p>The most interesting portion of this training for me was the use of technology.  Active learning is so difficult in an on-line session: how do you stop for evaluations or encourage students to interact?</p>\n<ul>\n<li>The video conference software Zoom allowed <strong>breakout rooms</strong> where we were paired off in small groups to discuss questions and present it back to the group.</li>\n<li>The collaborative note program <strong>Ether Pad</strong> served as the roadmap for the lesson.  The software has a chatbox, and colored text for tracking who writes what.  The frequent activities had us type our responses into Ether Pad where we could comment on one another's answers.</li>\n</ul>\n<p>I was also delighted that Workshops use a Jekyll template and github hosting for the website.  This site is powered by the same tools!</p>\n<h1>Conclusions</h1>\n<p>There were many other topics covered in the workshop, but these were my favorite.  If you are interested in learning more, please visit the <a href=\"https://software-carpentry.org/\">Software Carpentry</a> and <a href=\"http://www.datacarpentry.org/\">Data Carpentry</a> websites.  </p>","frontmatter":{"title":"Software Carpentry TakeAways"}}},"pageContext":{"slug":"/2017-10-05-carpentry_lessons/"}}