{"data":{"markdownRemark":{"html":"<p>An article posted on the <a href=\"http://blogs.scientificamerican.com/food-matters/2013/09/20/tannosomes-and-the-trickle-around-effect/\">Scientific American blog</a> caught my attention recently.  Researchers have discovered the existence of a new organelle, the tannosome, in plants.  It is this organelle that produces tannins, of great interest to wine lovers.  The scientific article in question, posted to <a href=\"http://sco.lt/5b1zST\">my scoop.it</a>, was officially published in the Annals of Botany on September 25th 2013, but it barely created a ripple in the news cycle.  Why not?</p>\n<p>Organelles are extraordinarily important in biology.  An organelle is, by definition, a membrane-bound compartment within a (eukaryotic) cell that performs some specialized function.  Much like each organ within the body performs a specific task, organelles within the cell include the DNA-replicating and transcribing nucleus, the “energy factory” mitochondria, and the “storage center” vacuole.  (Most) plants possess chloroplasts, organelles which house the photosynthetic machinery required to harness energy from light.</p>\n<img class=\" \" src=\"https://i1.wp.com/upload.wikimedia.org/wikipedia/commons/thumb/1/11/Animal_Cell.svg/800px-Animal_Cell.svg.png?resize=560%2C323\" alt=\"\" data-recalc-dims=\"1\" />\n<blockquote>\n<p>A diagram of the organelles in a typical animal cell.</p>\n</blockquote>\n<p>Tannins are known as secondary metabolites.  This term covers a huge range of array of chemically diverse molecules, lumped together for not being “primary” metabolites, such as proteins, sugars, or ribonucleic acids (such as DNA).  Often, but not always, secondary metabolites are important for “non-primary” processes, such as herbivory defense, pheremones, or pigmentation.  Tannins can be found in most plants, and may function in herbivory defense, pathogen defense, and UV-protection.  Humans are quite fond of tannins for their role in flavoring beverages<a href=\"http://winefolly.com/review/what-are-tannins-in-wine/\">, particularly wine</a>.</p>\n<p>Prior to this publication, there were reports of Tannins being found in chloroplasts- but no one had the idea that these were specialized unique organelles.  Similarly, the authors point out that chloroplasts <em>still produce</em> a number of secondary metabolites (phenolics, for example) despite this new organelle.  From what I can gather, the authors don’t make a case for this organelle producing anything other than tannins.</p>\n<p>So why the media silence?  <a href=\"http://blogs.scientificamerican.com/food-matters/2013/09/20/tannosomes-and-the-trickle-around-effect/\">One article</a>notes that with a lead-in to tea and wine, it really should have caught some buzz.  Not to mention the discovery of a new organelle (albeit derived from a known organelle) is noteworthy in anyone’s book, even if it doesn’t have obvious implications past tannin biosynthesis.  For whatever reason, it just isn’t the discovery that ignites people’s interest.  Science news is generally dominated by medicine, astronomy, sex, nutrition, and the cute or gross.  Perhaps if the finding had more implications for alcohol production or consumption, the media would have taken notice.  Maybe when tannosomes are harnessed to produce a new altered-tannin  wine, the world will take notice.  But without this study, one would not even know where to begin such a task.</p>\n<p>Sources:</p>\n<blockquote>\n<p>Brillouet JM, Romieu C, Schoefs B, Solymosi K, Cheynier V, et al. (2013) The tannosome is an organelle forming condensed tannins in the chlorophyllous organs of Tracheophyta. Ann Bot 112: 1003–1014.\nOrganelle image: from wikimedia commons, <a href=\"http://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Animal%5C_Cell.svg/800px-Animal%5C_Cell.svg.png\">http://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Animal_Cell.svg/800px-Animal_Cell.svg.png</a></p>\n</blockquote>","frontmatter":{"title":"The Tannosome"}}},"pageContext":{"slug":"/2013-09-26-the-tannosome/"}}