{"data":{"markdownRemark":{"html":"<h4>UK-BLAST workshop 2016</h4>\n<p>This tutorial was developed for Dr. Mark Farman at the University of Kentucky for Undergraduate students participating in UK-BLAST.  If you are trying to learn how to run applications from the command line but are feeling lost, this guide is for you.</p>\n<p>UK-BLAST is a bioinformatics working group for undergraduate researchers.  In small labs, students often tackle the bioinformatician role in with little to no technical guidance.  The group may not have anyone with a computer science background, or the task may be beyond the skills of current personnel.  In these cases, a working group headed by a technical mentor (myself) allows students to bypass some of the pitfalls and headaches associated with learning computer science all alone.</p>\n<!--more-->\n<h2>What is BLAST?</h2>\n<p>BLAST, or Basic Local Alignment Search Tool, is a program compares a protein or nucleotide query sequence against a database of known sequences.  BLAST has many different applications for many fields of biology.  For example, BLAST is commonly used...</p>\n<ul>\n<li>To compare sequences from different genomes.</li>\n<li>To compare similar genes within a genome.</li>\n<li>To create phylogenetic trees.</li>\n<li>To identify species given a DNA sample of unknown origin.</li>\n<li>To infer function of an unknown protein. </li>\n<li>To map DNA to a reference.</li>\n<li>To identify repeated sequences (self BLAST).</li>\n<li>To find conserved motifs in a protein (PSI-BLAST)</li>\n</ul>\n<p>When most users access BLAST, they do so via the <a href=\"http://blast.ncbi.nlm.nih.gov/Blast.cgi\">NCBI BLAST web portal</a>.  Here, one can paste in a sequence and search against GenBank or other comprehensive databases.  As of 2013, Genbank includes sequences from almost 260,000 formally described species.\nNote: for an extremely in depth summary of how BLAST works, see <a href=\"http://www.ncbi.nlm.nih.gov/BLAST/tutorial/Altschul-1.html\">the NCBI course here</a>. Be warned: there is a lot of higher math in this link. </p>\n<h3>Using BLAST remotely</h3>\n<p>Accessing data: let's go to GenBank and access some protein sequences by pointing a browser to <a href=\"http://www.ncbi.nlm.nih.gov/genbank/\">http://www.ncbi.nlm.nih.gov/genbank/</a>  </p>\n<p><img src=\"/assets/img/BLASTremote/rblast1.png\" alt=\"Blast remote\"></p>\n<blockquote>\n<ul>\n<li>Search for a protein you are interested in. For starters, let's look for ABC transporters in <em>Magnaporthe oryzae</em>, the fungus which causes a variety of blast diseases on different “grass” plants (including wheat and rice).</li>\n</ul>\n</blockquote>\n<p>Here is a top hit.  Note that the Accession number, ELQ65981.1 as well as the gene ID 440486081 both serve to uniquely identify this protein.</p>\n<p><img src=\"/assets/img/BLASTremote/rblast2.png\" alt=\"Your first BLAST hit\"></p>\n<p>Clicking on the FASTA link for this sequence will display the protein's sequence in FASTA format.</p>\n<p><img src=\"/assets/img/BLASTremote/rblast3.png\" alt=\"Your first BLAST hit, in FASTA format\"></p>\n<blockquote>\n<p>Download a protein sequence and save it to its own FASTA file.  </p>\n</blockquote>\n<p>Be careful copy-pasting and opening sequence files in programs like Microsoft Word - they will introduce hidden characters that will corrupt bioinformatic analyses.   It's best to download files directory, or to use \"safe\" text editors like Textwrangler or SublimeText.</p>\n<h4>Searching the BLAST database</h4>\n<p>The National Institute of Health hosts a fantastic BLAST database at their website, available at <a href=\"http://blast.ncbi.nlm.nih.gov/Blast.cgi\">http://blast.ncbi.nlm.nih.gov/Blast.cgi</a>\n<em>Note</em>:  if your websession fails, you can access previous results by clicking on the \"Recent Results\" link.</p>\n<blockquote>\n<ul>\n<li>Visit the NCBI blast database.  Explore the different types of BLAST available and make sure you understand the different BLAST “flavors”</li>\n</ul>\n</blockquote>\n<ul>\n<li>Paste or upload your FASTA file into the protein BLAST search form (careful about giving them too many options). For now, we will use the default search parameters. Make sure that the database you are querying is the non-redundant protein database.</li>\n</ul>\n<p> A view of the BLAST results is provided below.</p>\n<p><img src=\"/assets/img/BLASTremote/rblast4.png\" alt=\"BLAST query interface\"></p>\n<p>The <em>conserved domains</em> section gives us an overview of the protein.  You can click on individual regions of the protein to learn more about each domain.  Because we searched with an ABC protein, we see an ATP-binding cassette (ABC) domain, a ABC_membrane domain, and a second ABC domain.</p>\n<blockquote>\n<ul>\n<li>Click on the conserved domains of your protein.  Write down each domain name, and what function you think each domain might perform for the protein. </li>\n</ul>\n</blockquote>\n<p>We will learn more about predicting protein domains, and understanding conserved domains, in a later lesson.\nNavigate back to the blast results page (back on your browser), and scroll down to the colored alignments section.</p>\n<p><img src=\"/assets/img/BLASTremote/rblast5.png\" alt=\"BLAST query interface close up\"></p>\n<p>BLAST will list results in descending order.  In the example of the first six results above, our query protein is given at the top, and each result is drawn as a series of colored boxes.  The higher the alignment score for a region, the more similar that protein is. </p>\n<blockquote>\n<ul>\n<li>From which species are the top 10 hits? </li>\n</ul>\n</blockquote>\n<ul>\n<li>How many hits retrieved have a percent identity greater than 95%?</li>\n<li>Are the hits with low % identity still listed as ABC transporters?</li>\n<li>\n<p>Look at the header rows in the Descriptions section.  What does each column mean?  Translate each header below.  If you need help, you can look up the term in the BLAST glossary. </p>\n<pre><code>Max score\nTotal Score\nQuery Cover\nE value\nIdent\nAccession\n</code></pre>\n</li>\n</ul>\n<h4>Storing BLAST results</h4>\n<p>Let's say we wanted to store the sequences of proteins retrieved in our BLAST.  To do this, scroll down to the list of hits, click \"select all\", then Download, and hit \"continue\" with the FASTA (complete sequence) option checked.  This will download all of our hit sequences to a single FASTA file.  By selecting Text, on the other hand, we can download the BLAST output itself (the alignments, e values, etc).</p>\n<p><img src=\"/assets/img/BLASTremote/rblast6.png\" alt=\"batch download BLAST results\"></p>\n<blockquote>\n<ul>\n<li>Download all sequences matched by BLAST to a single FASTA file.</li>\n</ul>\n</blockquote>\n<ul>\n<li>In your UNIX terminal, create a working directory for this tutorial.  Move your downloaded sequences to that folder (on OS X, your default download location is /Users/yourname/Downloads/) using the <code>mv</code> command.    </li>\n</ul>\n<p>There are many things we can do with this dataset. We could look for conserved domain structures in ABC proteins, align the sequences, build a phylogenetic tree, or search new genomes for more ABC transporter sequences.  Storing the data with clear names, typically with a corresponding notebook describing what the data contains and the goal of your project, is essential for keeping track of your work!\nIn the second part of this walkthrough, we will use a single ABC sequence to identify all candidate ABC transporters in a genome.</p>\n<h3>Downloading genomes from Genbank</h3>\n<p>Alternatively, we may want to download an entire genome to work with later.  Typically, we want either the protein catalogue (a single FASTA file with all of the predicted amino acid sequences for a genome, corresponding to each gene) and/or the assembly (the nucleotide sequence of the entire genome, broken up into contigs or scaffolds [sets of smaller nucleotide sequence \"pieces\" stitched together and assembled as best as possible.  The best possible assembly will have a single scaffold for each chromosome]).</p>\n<h3>Navigating from a BLAST result to a genome</h3>\n<p>Finding this raw data can sometimes be challenging.  Let's say we're interested in finding our top BLAST hit above in the <em>Magnaporthe oryzae</em> (species name) Y34 (strain name) assembly.   If we click on it's name, this brings us to the alignment, where we can click on the sequence ID <a href=\"http://www.ncbi.nlm.nih.gov/protein/440470910?report=genbank&#x26;log$=protalign&#x26;blast_rank=1&#x26;RID=DWCKYC6P014\">ELQ39949.1</a>.</p>\n<blockquote>\n<ul>\n<li>How many amino acids long is this protein?</li>\n</ul>\n</blockquote>\n<ul>\n<li>If we wanted to read the article describing this sequence (and likely this genome) what journal and issue would we find it in?</li>\n<li>What evidence on this page confirms this protein is an ABC transporter?    <em>Hint: try clicking on the links labeled INTERPRO and CDD.</em></li>\n</ul>\n<p>If you click on <strong>ORGANISM</strong> <a href=\"http://www.ncbi.nlm.nih.gov/Taxonomy/Browser/wwwtax.cgi?id=1143189\"><em>Magnaporthe oryzae</em> Y34</a> at the top of the page, you will arrive at NCBI's taxonomy browser.  From here we can find many useful resources, but for right now, let's focus on the \"Entrez records\" on the right hand side of the screen.  We'd like to download the \"Assembly\" and all of the associated proteins.</p>\n<blockquote>\n<p>Click on the \"1\" next to \"Assembly\" to go to the Entrez assembly record.   </p>\n</blockquote>\n<p>We're almost there!\nThe assembly page has even more information about this strain's genome sequence.  Of particular interest is the genome coverage, the sequencing technology, the total sequence length, and the number of scaffolds. </p>\n<blockquote>\n<p>Click on the \"Download the Genbank assembly\" link to access the genome download page.</p>\n</blockquote>\n<p>At this point, you should be pointed at ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA<em>000292585.1</em>MoY34_2.0.  This is an FTP site, which means we could connect to this site via the terminal to download from the command line!  It may look like a lot of stuff here: if you're confused, check the README.TXT file.  It's common practice for people to include a README file explaining the contents of these repositories.  We want the nucleotide sequences in FASTA format and the protein sequences in FASTA format, which correspond to the files ending in protein.faa and genomic.fna.</p>\n<blockquote>\n<ul>\n<li>Download the nucleotide assembly and the full protein catalogue of this genome. </li>\n</ul>\n</blockquote>\n<ul>\n<li>In UNIX, make a folder for your whole genome assemblies.  You may like to keep one folder for proteins, and another for nucleic acids.</li>\n<li>Create a table (for example in excel) to keep track of your downloaded genomes.  Be sure to have a column for the file name (on your system), species name, strain name, where you downloaded the data from, reference, date downloaded, and version.  If you aren't sure of this information, it should be on the reference page.</li>\n</ul>\n<h3>Building a database relevant to your project</h3>\n<p>Now that you've downloaded a genome, you may want to have a database of genomes relevant to your own project.  To get started on this, go back to your original BLAST search (or perform a new search if you've lost the page).  </p>\n<blockquote>\n<ul>\n<li>Following the above steps, attempt to download another organism's full nucleotide assembly and protein catalogue.    Be sure to add its information to your genome database spreadsheet. </li>\n</ul>\n</blockquote>\n<p>Genbank is one of many data repositories where datasets are available.  Depending on your project, you may download assemblies from other sources.  Databases and assemblies are updated and change, which is why its important to <em>keep track of what version you are using, and where you got it from</em>.</p>\n<p>In the next lesson, we'll go over installing and running BLAST locally.</p>","frontmatter":{"title":"Introduction to BLAST"}}},"pageContext":{"slug":"/2017-05-03-remoteBlast/"}}